{"nodes":[{"label":"Nicodromos the betrayer.","x":1149.0390625,"y":397.5737609863281,"id":"118","attributes":{"summary":"In order to take their own revenge against the Eginetans, the Athenians found a man in Egina named Nicodromos, who was willing to betray his countrymen because they had previously banished him. With Nicodromos, the Athenians arranged to take the island of Egina on a certain day.","level of digression":"2","section(s)":"6.88","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Miltiades\u0027 family lineage.","x":1474.9342041015625,"y":-1480.868408203125,"id":"42","attributes":{"summary":"Pisitratus was ruling Athens. Miltiades was also thought of highly, belonging to a family that won many four-horse chariot races and had long lived in Athens.","level of digression":"2","section(s)":"6.35.1","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Callias and the Pisistratidae.","x":1397.8516845703125,"y":1657.9794921875,"id":"170","attributes":{"summary":"Callias was the only person who bought the goods that had been put out for sale after the Pisistratidae were driven out of Athens.","level of digression":"3","section(s)":"6.121.2","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Lesbians love Histaios.","x":-1829.3226318359375,"y":-1597.8896484375,"id":"4","attributes":{"summary":"Histiaios was wounded by the Milesians while trying to return to Miletus. He then was unsuccessful in persuading the Chians to give him ships, but the Lesbians did give him eight triremes. Histiaios and the Lesbians seized ships in the Euxine.","level of digression":"1","section(s)":"6.5","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Hippocrates betrays Zancle.","x":385.0869140625,"y":-2131.55029296875,"id":"28","attributes":{"summary":"The Samians were convinced to turn on the Zanclaeans, and soon take their city. The Zanclaeans called Hippocrates, their ally. Hippocrates brought an army to help them, and seized Scythas, the Zanclaean king, on the way. Hippocrates made a deal with the Samians to betray the Zanclaeans, in return for half of the goods and salves.","level of digression":"3","section(s)":"6.23","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Herodotus has seen the mines.","x":835.7294311523438,"y":-363.17816162109375,"id":"62","attributes":{"summary":"Herodotus himself has seen these mines. The Phoenicians discovered some mines when they colonized the island.","level of digression":"4","section(s)":"6.47","commentary":"[Tertiary Digression]"},"color":"rgb(234,134,21)","size":12.0},{"label":"Datis is merciful to Delos.","x":-511.1924133300781,"y":804.6917724609375,"id":"130","attributes":{"summary":"The Delians fled Delos in fear of the Persians, but Datis anchored his ships at Rhenea instead of Delos, and discovered the place to which the Delians had fled. Datis sent a message to the Delians, saying that he would not harm them and inviting them to return home.","level of digression":"1","section(s)":"6.97","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"The Plateans surrender to the Athenians.","x":-518.77099609375,"y":2152.119140625,"id":"151","attributes":{"summary":"The Plateans immediately asked the Athenians for help, and the Athenians agreed. The Thebans heard this and marched on Platea, and the Athenians sent in their army to help. The Corinthians stopped the battle about to happen and said that the Thebans should let the Plateans join the Athenians. When the Athenians were marching home the Boetians attacked them. The Athenians defeated them, and the Corinthians set boundary lines to lessen the conflict. This is how the Plateans came to help the Athenians.","level of digression":"2","section(s)":"6.108.4-6","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Dionysius becomes a pirate.","x":-274.6338806152344,"y":-1857.752197265625,"id":"18","attributes":{"summary":"Dionysius decided, seeing the direction of the battle, to take three captured ships and sale them to Phonecia. He pirated merchant ships for money, and sailed to Sicily where he set up a base to pirate Carthaginian and Tyrhenian merchant ships. He left Greek ships alone, however.","level of digression":"1","section(s)":"6.17","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Perseus an Assyrian.","x":-448.6150817871094,"y":-413.7431945800781,"id":"70","attributes":{"summary":"According to the Persians, Perseus was an Assyrian who became a Greek. They believed, like the Greeks, that the forefathers of Acrisius were Egyptians.","level of digression":"4","section(s)":"6.54","commentary":"[Tertiary Digression]"},"color":"rgb(234,134,21)","size":12.0},{"label":"Miltiades returns","x":1877.6527099609375,"y":708.06103515625,"id":"188","attributes":{"summary":"Miltiades came back to Athens injured and without having gotten money or having conquered Paros. When the Parians found out that Timo had spoken to Miltiades, they were going to punish her. They went to consult the oracle, and Pythia told them not to kill her because Timo had lured Miltiades so that he would one day die a terrible death.","level of digression":"2","section(s)":"6.135","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Phrynichus writes a play.","x":97.07642364501953,"y":-2352.908447265625,"id":"25","attributes":{"summary":"The Athenians were very upset that Miletus was taken. Phrynichus wrote a play called \"The Fall of Miletus,\" which was so poignantly sad that he was fined 1,000 drachmas for producing it.","level of digression":"3","section(s)":"6.21.2","commentary":"[Secondary Digression] Phrynicus\u0027 play is not one that we have today, but according to McQueen \"Phrynicus son of Polyphradmon, the greatest tragic poet of the day, [was] active from from 511 until at least 476.\" McQueen also notes that moving an audience to tears with a tragedy was the proper function of such a play, according to Aristotle. He thinks that the reason for the fine is politically motivated, perhaps related to \"impiety or a prosecution brought by the magistrates known as the agoranomoi against the individual responsible for the breakdown of law and order in a place under their jurisdiction.\" McQueen thinks that the play may have shown that they Persians were unbeatable, which Phrynicus\u0027 prosecutors would have disliked because it would have spread a certain negative message to the people. (McQueen, 101)."},"color":"rgb(0,202,255)","size":12.0},{"label":"The Persian army sets sail.","x":-310.8050231933594,"y":403.6707458496094,"id":"128","attributes":{"summary":"The Persian army, led by its new generals, traveled down to the sea and set sail for Ionia on horse transports that Darius had prepared ahead of time. The ships traveled through the islands to avoid passing by Mount Athos.","level of digression":"1","section(s)":"6.95","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Aeces, son of Syloson.","x":-797.2830200195312,"y":-1993.4287109375,"id":"13","attributes":{"summary":"Aeces son of Syloson was the former tyrant of Samos. He was deposed by Aristagoras of Miletus with the rest of the Ionian tyrants.","level of digression":"2","section(s)":"6.13.2","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Nicodromos the pirate.","x":1481.7962646484375,"y":88.10563659667969,"id":"121","attributes":{"summary":"Nicodromos and those who followed him settled at Sunium and make raids against the island of Egina.","level of digression":"3","section(s)":"6.90.1b","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"The very special well.","x":1176.4521484375,"y":1746.0784912109375,"id":"166","attributes":{"summary":"From the well came bitumen, salt and oil. They used half a wine skin to pull up the liquid and poured the liquid into a resovoir. The liqued then seperated and the salt and bitumen hardened while the oil was taken into casks. The Persians called it \"rhidance\" which was black and bad smelling. The Eretrians were settled near to this well.","level of digression":"3","section(s)":"6.119.3-4","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"The Ionian tyrants send messages.","x":-1408.18212890625,"y":-1924.05224609375,"id":"9","attributes":{"summary":"The Persians arrived in Miletus, and each Ionian tyrant sent word to his own land that they could revolt against the Persians. Each group of Ionians thought that they alone receieved this message and as a result, they all refused the offer.","level of digression":"1","section(s)":"6.10","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Ariston takes a third wife.","x":-973.314697265625,"y":-537.0052490234375,"id":"79","attributes":{"summary":"Ariston said to his best friend that they should each take from each other some possession. Ariston chose his friend\u0027s wife.","level of digression":"3","section(s)":"6.62","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"The Persian fleet sails against Miletus.","x":-1732.9244384765625,"y":-1686.7999267578125,"id":"5","attributes":{"summary":"The Persians joined forces and sailed against Miletus. The Pheonicians were particularly eager to join the battle, and came with the Cyprians, Cilicians, and Egyptians.","level of digression":"1","section(s)":"6.6","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"The Battle of Marathon.","x":126.04963684082031,"y":2019.531494140625,"id":"155","attributes":{"summary":"The Athenians immediatly began running and charged the Persians.The Persians waited to recieve them, thinking the Athenians were suicidal and insane. The Athenians and the Persians joined battle.","level of digression":"1","section(s)":"6.112.1-3a","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Epizelus\u0027 sudden onset blindness.","x":899.8343505859375,"y":1711.62890625,"id":"163","attributes":{"summary":"Epizelus son of Cuphagoras suddenly became blind in the middle of the battle, without having been hit by anything, and was blind for the rest of his life. He said that he saw a huge warrior with a beard, that passed him by and killed the man next to him instead.","level of digression":"2","section(s)":"6.117.2-3","commentary":"[Primary Digression] There are several of this story about a warrior in the battle of Marathon going blind and having the man next to him killed. Pseudo Plutarch writes about a man named Polyzelus who \"having seen a supernatual vision, lost his sight\" (Plut. Para. 1). While the Cambridge Companion to Herodotus calls this phenomena \"hysterical blindness,\" the scene is also considered by some scholars to be an example of PTSD in the ancient world (cf. Achilles in Vietnam by Jonathan Shay; \"Caesar in Vietnam: Did Roman Soldiers Suffer From PTSD\" by Aislinn Melchior\")."},"color":"rgb(198,134,233)","size":12.0},{"label":"The famous Alcmaeonidae.","x":1238.79248046875,"y":1004.6272583007812,"id":"182","attributes":{"summary":"The Alcmaeonidae became famous in Greece after this. The son of Agariste and Megacles was named Cleisthenes after his grandfather. Megacles had another son named Hippocrates, who had a daughter named Agariste. She married a man named Xanthippus, and they had a son named Pericles.","level of digression":"5","section(s)":"6.131","commentary":"[Quaternary Digression] Rarely is the precise object of a digressive episode so obvious in Herodotus. The entire narrative glorifying the Alcmaeonidae (from the section \"The Alcmaeonidae.\" to this point) may be seen as leading to this \"exaltation of Pericles\" (How and Wells, 119)."},"color":"rgb(46,144,114)","size":12.0},{"label":"Datis\u0027 vision.","x":1068.1690673828125,"y":1681.1256103515625,"id":"164","attributes":{"summary":"Datis was on his way back to Asia and had a dream. He ordered that they find a statue of Apollo, and finding it he brought it to Delos and asked the Delians to bring it back to Theban Delium. He left, but the Delians never brought it to Thebes. 20 years later, as per a warning from the Oracle, the Thebans bought it back to Delium.","level of digression":"2","section(s)":"6.118","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"The Chians fight bravely, but flee.","x":-436.4881286621094,"y":-1794.966064453125,"id":"16","attributes":{"summary":"The Chian ships took heavy losses because they despised cowardice and stayed to fight. They ended up taking many Persian ships and fighting well, but lost many of their own ships in the process. They fled with the remainder of their ships.","level of digression":"1","section(s)":"6.15","commentary":"[Main Narrative] In chapter fifteen, Herodotus mentions \"forty men serving as marines\" aboard the Chian ships, which is a large number of people for a Greek ship. The numbers of Marines aboard a ship depended on the city or region a ship was from. According to McQueen, \"the number of marines on board a ship varied from city to city according to fighting tactics and the size of deck. The figure of 40 is the largest recorded, except perhaps for Xerxes marines at Salamis, when his ships each carried 30 prominent Persians or Medes (to guarentee loyalty on the part of the others?) on deck in addition to an unspecified number of native fighters. The regular number of marines on board Athenian ships was ten.\" (McQueen, 96)."},"color":"rgb(95,198,19)","size":12.0},{"label":"The Eginetans take revenge.","x":1051.1788330078125,"y":509.7924499511719,"id":"117","attributes":{"summary":"The Eginetans found an Athenians ship at Sunium and siezed it, in retribution for the Athenians having seized the Eginetan hostages.","level of digression":"2","section(s)":"6.87","commentary":"[Primary Digression] Sunium was an important island to the Athenians. There are sancturies there to Poseidon and Athen that date back to the 7th century, and a large Ionic temple to Athena was built in the eraly 5th century. This temple is notable for its asy,mmetrical design. Decades after the battle of Marathon, the Athenians fortified the island and rebuilt the fort. They eventually formed a small city there, since the area was rich with marble quarries and silver mines (Oxford Dictionary of the Classical World)."},"color":"rgb(198,134,233)","size":12.0},{"label":"Miltiades is judged for his actions.","x":2024.6474609375,"y":545.3831787109375,"id":"189","attributes":{"summary":"When Miltiades returned, the Athenians talked about putting him on trial for decieving Athens. In his defence, others spoke of his deeds at Marathon and his other accoomplishments, including how he conquered Lemnos. He was fined fifty talents, but died from the infection in his thigh, so his son Cimon paid the fine.","level of digression":"2","section(s)":"6.136","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Miltiades builds a wall.","x":1766.17236328125,"y":-1602.9356689453125,"id":"45","attributes":{"summary":"Miltiades built a wall from Cardia to Pactya, across the neck of the Chersonese. The wall was 36 furlongs wide.","level of digression":"3","section(s)":"6.36.2","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Ariston wants a third wife.","x":-851.07421875,"y":-420.6767578125,"id":"78","attributes":{"summary":"Ariston, king of Sparta, didn\u0027t have any children. He married a third wife in this way. His best friend was married to the most beautiful woman in Sparta.","level of digression":"3","section(s)":"6.61.2","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Cleomenes and Leotychides.","x":-959.1446533203125,"y":-351.7413330078125,"id":"83","attributes":{"summary":"Cleomenes agreed to help make Leotychides king if he betrayed Demaratus.","level of digression":"2","section(s)":"6.65.1","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Leotychides continues the story.","x":359.1139221191406,"y":611.611572265625,"id":"114","attributes":{"summary":"Leotychides continued telling the story of Glaucus, related that, when the Milesian man\u0027s sons came to Sparta, Glaucus refused to give them their father\u0027s money, saying that he needed four months to deliberate.","level of digression":"2","section(s)":"6.86b","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"The Ionians hold a council.","x":-1629.069580078125,"y":-1770.3658447265625,"id":"6","attributes":{"summary":"The Ionians held a counsel at Panionium, during which they decided not to meet the Persian army on land and rather to let the Milesians defend their city themselves. Instead, the Ionians gathered a fleet and sailed to Lade to defend Miletus at sea.","level of digression":"1","section(s)":"6.7","commentary":"[Main Narrative] \"[Panionium] is the meeting place of the federation of Ionian communities situated at the foot of the northern slopes of Mt. Mycale, and site of the sanctuary and sacred grove of Poseidon Heliconius. This federation, known as the Ionian League, had been formed initially to conduct the cult and celebrate the festival of the god, but in the course of the time, it came to acquire the political as well as religious functions.\" (McQueen, 89)."},"color":"rgb(95,198,19)","size":12.0},{"label":"The oracle lies.","x":-1443.2154541015625,"y":-248.43052673339844,"id":"86","attributes":{"summary":"The Spartans asked the oracle whether Demaratus was Ariston\u0027s son or not. The oracle was coerced through Cleomenes into saying that Demaratus was not Ariston\u0027s son. The prophetess was deprived of her office when this became known.","level of digression":"2","section(s)":"6.66","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Thasians take down their walls.","x":260.6026916503906,"y":-310.6900634765625,"id":"63","attributes":{"summary":"When Darius demanded the Thasians take down their walls, they did so, and sent their fleet to Abdera. Darius sent demands around Greece for everyone to give earth and water to the king.","level of digression":"1","section(s)":"6.48","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Histiaios in Sardis.","x":-2129.604736328125,"y":-1271.4727783203125,"id":"0","attributes":{"summary":"Histiaios arrived in Sardis and had a conversation with Artaphernes, where Artaphernes insinuated that he knew the truth about the Ionian revolt.","level of digression":"1","section(s)":"6.1","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Euagoras\u0027 victories.","x":-1413.937255859375,"y":1609.0294189453125,"id":"139","attributes":{"summary":"The only other person to win the four-horse chariot race with the same mares three times was Euagoras the Lacedaimonian. No other Greek has done this.","level of digression":"3","section(s)":"6.103.4a","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Rights of dead Spartan kings.","x":-581.6303100585938,"y":-635.0006713867188,"id":"74","attributes":{"summary":"Horsemen carryed the news of a Spartan king\u0027s death through Laconia while women mourn. Mourning was required by law. Many were forced to attend the funeral, and walk through the streets smacking their foreheads. If a king died in battle, they make a statue of him and mourned for ten days before electing new magistrates.","level of digression":"5","section(s)":"6.58","commentary":"[Quaternary Digression]"},"color":"rgb(46,144,114)","size":12.0},{"label":"Miltiades and Lemnos.","x":2401.52880859375,"y":24.167402267456055,"id":"196","attributes":{"summary":"Many years later, Miltiades sailed on Etesian winds from the Chersonese to Lemnos and told the Pelasagians to get out because of the prophecy. They refused because the Chersonese were not in Attica, and Miltiades subdued them by force. Lemnos was then under Athenian control.","level of digression":"3","section(s)":"6.140","commentary":"[Secondary Digression] Ultimately, How and Wells assert that \"the capture of Lemnos forms an admirable finale, making a pause in the history before the great war, and recalling the great services of the hero Miltiades instead of closing the book with his miserable death\" (How and Wells, 124). This conclusion, however, ends the narrative in the middle of a secondary digression, far from the main episode of the Persian war. While one might read this ending as \"admirable\" in that accomplishes Herodotus\u0027 stated goal of recording the great deeds of the Greeks and the Barbarians, it results in \"an obvious break between the sixth and seventh books,\" (How and Wells, 124) which results in an imbalanced narrative structure, highlighting not the major conflict of the Persian war, but the smaller conflicts that affected the region, and the small deeds that incurred great retribution. Here, the final action of the book stems from the linguistic rebellion of the captured Athenian women."},"color":"rgb(0,202,255)","size":12.0},{"label":"Cleomenes goes to the temple of Juno.","x":-1225.4769287109375,"y":514.4843139648438,"id":"106","attributes":{"summary":"Cleoemenes sent most of his army home, and went to the temple of Juno with a thousand of his best troops to offer sacrifice. He was forbidden from sacrificing in the temple because he was a foreigner. Cleomenes had the priest dragged from the altar and performed the sacrifice anyway. He then returned to Sparta.","level of digression":"2","section(s)":"6.81","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"River Erasinus.","x":-2235.4111328125,"y":621.4254150390625,"id":"100","attributes":{"summary":"The river Erasinus flows from the Stymphalian lake.","level of digression":"5","section(s)":"6.76.1b","commentary":"[Quaternary Digression]"},"color":"rgb(46,144,114)","size":12.0},{"label":"The Athenians are late to the party.","x":1281.144287109375,"y":258.0367736816406,"id":"119","attributes":{"summary":"The Athenians did not have enough ships to take Egina, so they had to purchase ships from the Corinthians. However, they arrived at Egina a day later than they had planned.","level of digression":"2","section(s)":"6.89","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"The Spartans are tourists.","x":1088.7318115234375,"y":1431.57421875,"id":"168","attributes":{"summary":"Since they came too late but still wanted to see Persians, the Spartans marched to Marathon and viewed the dead bodies. They commended the Athenians for their victory and returned home.","level of digression":"2","section(s)":"6.120.1b","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Class conflict in Egina.","x":1503.5531005859375,"y":19.749526977539062,"id":"122","attributes":{"summary":"The remaining wealthy Eginetans who drove out Nicodromos and his followers seized some of the common people who had rebelled alongside Nicodromos","level of digression":"2","section(s)":"6.91.1a","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"The Pelasagians in Lemnos.","x":2294.06103515625,"y":255.998046875,"id":"193","attributes":{"summary":"The Pelasagians wished revenge on Athens, so they kidnapped a large number of Athenian women at a festival to Diana and kept them as concubines at Lemnos. The women who were captured taught their children Attic language and raised them in the Athenian way, and their sons refused to comply with Pelasagian rules. The Pelasagians grew nervous and killed the sons of the Attic women and their mothers.","level of digression":"3","section(s)":"6.138.1-4a","commentary":"[Secondary Digression] Blok asserts that “Herodotus presents a view of the world in which women played a central role in all cultural and social relations” (Blok, 227). One of the primary ways women in Herodotus\u0027 narrative assert power over cultural relations is through their linguistic instruction: by teaching their half-Pelasgian children to speak Attic Greek, they disrupt the enculturation of these children into the dominant Pelsgian culture."},"color":"rgb(0,202,255)","size":12.0},{"label":"The Athenians wait at Marathon.","x":-1139.9189453125,"y":1644.8707275390625,"id":"137","attributes":{"summary":"The Athenians heard of the Persians landing at Marathon. Miltiades and the Athenian troops awaited the Persians there.","level of digression":"1","section(s)":"6.103.1","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Hippias\u0027 tooth.","x":-1020.0073852539062,"y":1962.403564453125,"id":"148","attributes":{"summary":"Hippias then coughed and sneezed, and lost a tooth due to the strength of his coughing. He couldn\u0027t find his tooth in the sand, and he interpreted this as saying that he would not be able to conquer this land.","level of digression":"2","section(s)":"6.107.3-4","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"The Ionians rebel against Dionysius.","x":-859.2469482421875,"y":-1889.7999267578125,"id":"11","attributes":{"summary":"At first, the Ionians were willling to follow Dionysius\u0027 commands. But after seven days of hard labour they rebelled against him and refused to do their work or practice their manoeuvres.","level of digression":"1","section(s)":"6.12","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Some Persian names, explained.","x":-605.3502807617188,"y":1062.1361083984375,"id":"132","attributes":{"summary":"Herodotus explains the meanings of the names Darius, Xerxes, and Artaxerxes in the Persian language.","level of digression":"2","section(s)":"6.98.3b","commentary":"[Primary Digression] This digression is not merely onomastic or genealogical, but temporal: How and Wells point out that, by tying these three Persian kings to \"generations\" (τριῶν τουτέων ἐπεξῆς γενεέων, Hdt. 6.98.2), Herodotus can chart the time of his own writing relative to the Persian chronology, suggesting \"that the passage was written nearly a century after the ascension of Darius,\" on account of the assumption that Artaxerxes would have had to have been ruling for a comparable number of years to the those during which Darius and Xerxes reigned – 36 years and 21 years respectively. (How and Wells, 104)."},"color":"rgb(198,134,233)","size":12.0},{"label":"The Argives consult an oracle.","x":-131.45187377929688,"y":-2004.62451171875,"id":"20","attributes":{"summary":"The Argives consulted an oracle about the fate of their city, and received an oracle in part about themselves, and in part about the Milesians.","level of digression":"2","section(s)":"6.19.1","commentary":"[Primary Digression] The Argives were consulting an oracle about the fate of their city: \"a reference to the war fought with Sparta in 494, which culminated in the Argive defeat at Sepeia. As this oracular consultation is omitted from Herodotus\u0027 narrative of the war in question, it is unclear whether it took place at the start of the campaign or after the defeat at Sepeia.\" (McQueen, 98)."},"color":"rgb(198,134,233)","size":12.0},{"label":"The escape of Nicodromos.","x":1407.1044921875,"y":129.855712890625,"id":"120","attributes":{"summary":"Because the Athenians were late to arrive, Nicodromos fled Egina.","level of digression":"2","section(s)":"6.90.1a","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Miltiades sails on Paros.","x":1555.6590576171875,"y":1044.34765625,"id":"184","attributes":{"summary":"Miltiades sailed on Paros, saying it was revenge because the Parians sent a trireme to Marathon to help the Persians.","level of digression":"2","section(s)":"6.133.1a","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Dolonci consult the oracle.","x":1373.78466796875,"y":-1421.796630859375,"id":"41","attributes":{"summary":"The Dolonci sent princes to Delphi. The oracle told them to take back with them the first man to offer them hospitality. Traveling back home, no one offered them hospitality, so they turned towards Athens.","level of digression":"2","section(s)":"6.34.2","commentary":"[Primary Digression] Herodotus mentions in this chapter \"The Sacred Way\", \"the route from Delphi east through Phocis, Chaeronea and Thebes to Eleusis, where it joined the more famous Sacred Way leading to Athens. It was sacred in the sense that all pilgrims to Delphi were under Apollo\u0027s protection and was the route taken by processions to Delphi by land approaching from the west.\" (McQueen, 111)"},"color":"rgb(198,134,233)","size":12.0},{"label":"Leotychides sues Demaratus.","x":-1230.4100341796875,"y":-282.70703125,"id":"85","attributes":{"summary":"Leotychides sued Demaratus, saying he is not the rightful king of Sparta. He did so on the grounds that Ariston had originally denied Demaratus as his son.","level of digression":"2","section(s)":"6.65.3-4","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"The Athenians refuse.","x":-50.865638732910156,"y":552.851806640625,"id":"112","attributes":{"summary":"The Athenians refused to release the hostages from Egina because only one of the kings of Sparta ordered them to do so, whereas both kings of Sparta had before ordered them to keep the hostages.","level of digression":"2","section(s)":"6.86","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"The Phoenicians attack the Ionians.","x":-748.2796630859375,"y":-1827.01806640625,"id":"14","attributes":{"summary":"The Phoenecian ships attacked the Ionians. The Samians fled, except for eleven ships, and the Lesbians followed suit when they saw the Samians leaving. After this, many other Ionian ships followed them.","level of digression":"1","section(s)":"6.14.1-2","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Dorians are Egyptians.","x":-324.5213623046875,"y":-320.68634033203125,"id":"69","attributes":{"summary":"Perseus has no mortal father, so Herodotus says \"up to Perseus.\" The chiefs of the Dorians, following the line of Danad, were really Egyptians.","level of digression":"5","section(s)":"6.53.2","commentary":"[Quaternary Digression]"},"color":"rgb(46,144,114)","size":12.0},{"label":"The Samians defect to the Persians.","x":-814.41845703125,"y":-1859.1553955078125,"id":"12","attributes":{"summary":"The Samians, having seen how the Ionian forces were falling apart, chose to agree to Persian terms and flee the battle. They decided this based on a message sent to them from Aeces son of Syloson.","level of digression":"1","section(s)":"6.13.1","commentary":"[Main Narrative] This main narrative section, as How and Wells observe, is actually composed of two passages, which attempt explain away the actions of the Samians, surrounding a middle passage that lays out \"the bare fact of their threachery\" (How and Wells, 69). While not digressive itself, this structure explains the positioning of the digression that follows (c.f. the section \"Aeces, son of Syloson.\"); Herodotus does not want to interrupt his Samian apology to provide a geneology, but nonetheless sees the need to clarify Aeces\u0027 identity."},"color":"rgb(95,198,19)","size":12.0},{"label":"The Athenians are joined by the Plateans.","x":-714.1271362304688,"y":1996.09619140625,"id":"149","attributes":{"summary":"The Athenians were strategizing in the Heraklea, when the Plateans arrived. The Plateans had done many things to help the Athenians after being brought under their rule.","level of digression":"1","section(s)":"6.108.1","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"The Alcmaeonidae.","x":1322.8563232421875,"y":1557.2203369140625,"id":"169","attributes":{"summary":"Herodotus finds it unbelievable that the Alcmaeonidae would betray Athens and wish to become Persian subjects, because the Alcmaeonidae hated tyrants. They hated tyrants as much as Callias son of Phaenippus, who was father to Hipponicus.","level of digression":"2","section(s)":"6.121.1","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Demaratus shamed.","x":-1756.210693359375,"y":-236.58143615722656,"id":"88","attributes":{"summary":"Demaratus, no longer a king, became a magistrate. After Leotychides shamed him at the public games, Demaratus went home and sacrificed an ox to Jupiter, calling as well for his mother.","level of digression":"3","section(s)":"6.67.2-3","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Dorians are Greek.","x":-448.5541076660156,"y":-351.26336669921875,"id":"68","attributes":{"summary":"The kings of the Dorians, \"up to\" Perseus, were considered to be Greek as well.","level of digression":"4","section(s)":"6.53.1","commentary":"[Tertiary Digression]"},"color":"rgb(234,134,21)","size":12.0},{"label":"Histiaios flees to Chios.","x":-2072.250244140625,"y":-1338.3079833984375,"id":"1","attributes":{"summary":"Histiaios had lied to Darius, promising the conquer Sardo. In reality, Histiaios had planned to lead the Ionians in a war against Darius. Histaios went to Chios and was captured by the Chians, who suspected him of supporting King Darius. Learning that Histiaios was not loyal to Darius, the Chians let him go.","level of digression":"1","section(s)":"6.2","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Miltiades (son of Cimon).","x":1523.298095703125,"y":-1190.7545166015625,"id":"50","attributes":{"summary":"When Stesagoras died, the Pisitratidae sent Miltiades (son of Cimon) to the Chersonese to rule.","level of digression":"2","section(s)":"6.39.1","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Miltiades invites in the Dolonci.","x":1580.4703369140625,"y":-1547.662109375,"id":"43","attributes":{"summary":"Miltiades welcomed the Dolonci, who were dressed outlandishly. The Dolonci revealed the oracle to Miltiades. Miltiades did not like the government of Pisistratus, so he went to Delphi to ask about the oracle of the Dolonci.","level of digression":"2","section(s)":"6.35.2","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"The history of the Alcmaeonidae.","x":1651.195556640625,"y":1353.00537109375,"id":"175","attributes":{"summary":"The Alcmaeonidae had long been a notable family in Athens, especially since the days of Alcmaeon and Megacles.","level of digression":"3","section(s)":"6.125.1","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Slaves manage Argos.","x":-785.98828125,"y":584.2573852539062,"id":"108","attributes":{"summary":"There were so few men left in Argos that the slaves now managed the state. The sons of the men slain by Cleomenes grew up and cast out the slaves, who likewise won Tiryns in a battle. After battling for many years, the Argives gained the upper hand.","level of digression":"2","section(s)":"6.83","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Miltiades lays seige to Paros.","x":1718.6739501953125,"y":876.6768188476562,"id":"186","attributes":{"summary":"Miltiades put Paros under seige. The Parians defended their city by doubling the walls.","level of digression":"2","section(s)":"6.133.2-3","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Miltiades flees and returns.","x":1449.7044677734375,"y":-1063.296875,"id":"52","attributes":{"summary":"Miltiades fled the invading nomads, who were mad at Darius. The Dolonci caught up with Miltiades and brought him back.","level of digression":"3","section(s)":"6.40","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"The Argives at the river.","x":-1936.110595703125,"y":415.9041748046875,"id":"102","attributes":{"summary":"The Argives marched to defend their country and pitch their tends opposite the Lacedaemonians. They knew of an oracle that said a trick would be practiced on them. Keeping the oracle in mind, the Argives copied whatever military maneuvers made by the Lacedaemonians.","level of digression":"4","section(s)":"6.77","commentary":"[Tertiary Digression]"},"color":"rgb(234,134,21)","size":12.0},{"label":"Miltiades is charged for Tyranny.","x":-1520.6513671875,"y":1738.6572265625,"id":"141","attributes":{"summary":"Miltiades the younger, commander of the Athenians, escaped from the Chersonese. He was chased by the Phonecians, who wanted to take him to the king. Then he was caught in Athens and brought to court for tyranny. He got off the charges and was chosen as general by the Athenian people.","level of digression":"3","section(s)":"6.104","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Miltiades stumbles upon the Phoenician fleet.","x":1330.453369140625,"y":-1121.6466064453125,"id":"53","attributes":{"summary":"Miltiades heard that the Phoenicians were attacking Tenedos, and sailed for Athens with five triremes. He came upon the whole Pheonician fleet.","level of digression":"1","section(s)":"6.41.1","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Artaphernes intercepts Histiaios\u0027 letter.","x":-1918.5831298828125,"y":-1507.5948486328125,"id":"3","attributes":{"summary":"Histiaios gave Hermippus (a messenger) a letter meant for the Persians. Hermippus instead gave the letter to Artaphernes. Artaphernes told Hermippus to get a response from the Persians and then return to him. Artaphernes used this information to kill many Persians.","level of digression":"1","section(s)":"6.4","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Miltiades\u0027 lie","x":1584.46044921875,"y":997.2391357421875,"id":"185","attributes":{"summary":"Miltiades was lying, he actually wanted to attack the Parians because one of them was telling stories about him to a Persian.","level of digression":"3","section(s)":"6.133.1b","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Cleomenes and Demaratus.","x":-673.2102661132812,"y":-382.8428039550781,"id":"77","attributes":{"summary":"Recall that Cleomenes was in Egina, and Demaratus was drawing charges against him. Cleomenes returned from Egina and tried to despose Demaratus.","level of digression":"2","section(s)":"6.61.1","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"The Spartans give up Leotychides.","x":-301.35626220703125,"y":584.1776123046875,"id":"111","attributes":{"summary":"The Spartans agreed to give up Leotychides to the Eginetans, whom he had wronged through his treatment of their hostages in Athens. However, before the ambassadors from Egina could lead Leotychides away, Theasides convinced them to take Leotychides to Athens instead, so that they could retrieve their men.","level of digression":"2","section(s)":"6.85","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"The first of the Greeks.","x":100.37681579589844,"y":2124.85986328125,"id":"156","attributes":{"summary":"The Athenians were the first Greeks to charge the enermy at a run. They were also the first Greeks to even see the Persians up close.","level of digression":"2","section(s)":"6.112.3b","commentary":"[Primary Digression] McQueen would like readers to note that Herodotus must be referring to mainland Greeks specifically, as Greeks living in colonies in Ionia and other places would have seen and interacted with Persians many times before. (McQueen, 201)."},"color":"rgb(198,134,233)","size":12.0},{"label":"The Alcmeonidae are accused of treachery.","x":532.4609985351562,"y":1954.7606201171875,"id":"160","attributes":{"summary":"The Alcmeonidae were accused by fellow Athenians of betraying Athens to the Persians. The Athenians said that the Alcmeonidae used a shield to signal that the Persians should sail around Sunium.","level of digression":"2","section(s)":"6.115.1b","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Histaios lies to the Ionians.","x":-1999.83984375,"y":-1420.0701904296875,"id":"2","attributes":{"summary":"The Ionians questioned Histiaios about why he ordered Aristagoras to do harm to the Ionians. Histaios lied and said that Darius had been planning to resettle the Ionians in Phoenicia, and likewise, the Phoenicians in Ionia.","level of digression":"1","section(s)":"6.3","commentary":"[Main Narrative] Resettling was a common method used by ancient Near Eastern kings to control unruly populations. This resettlement would have had additional ideological implications, however, because of \"the hatred felt for the Ionians by the Phoenician traders, whom they had supplanted in the Levant and threatened in the West\" (How and Wells, 66-67)."},"color":"rgb(95,198,19)","size":12.0},{"label":"Artaphernes makes peaceful deals.","x":1203.708251953125,"y":-977.9170532226562,"id":"55","attributes":{"summary":"Artaphernes summoned deputies from all the Ionian cities, forcing them to compromise. He also determined the amount of tribute each city should pay, a rate that continued to be used for a long time.","level of digression":"1","section(s)":"6.42","commentary":"[Main Narrative] McQueen tells us that if Herodotus is correct and the Ionians are still paying these tributes, \"we are faced with the uncomfortable prospect of having to believe that, after joining the Delian League, the Ionians paid tribute to both Persia and Athens.\" According to McQueen, scholars accept this as fact even though there are no Ionians who have complained about the large strain of paying two tributes at once. But it is also possible that Herodotus means to say that this was the case until the Ionians joined the Delian League. (McQueen, 121)."},"color":"rgb(95,198,19)","size":12.0},{"label":"Battle between Athens and Egina.","x":-87.37012481689453,"y":459.334716796875,"id":"124","attributes":{"summary":"When the Eginetans and the Athenians met in a naval battle, the Eginetans suffered an initial defeat. They then appealed to the Argives for aid, and although the government of Argos refused to send help, many individual Argive men came to help the Eginetans.","level of digression":"2","section(s)":"6.92","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Miltiades captured and released.","x":1730.4171142578125,"y":-1390.3544921875,"id":"46","attributes":{"summary":"Having completed his wall, Miltiades attacked the Lampsacenians, but was taken prisoner in the process. Croesus, king of Lydia, favored Miltiades and commanded the Lampsacenians to free Miltiades. Croesus threatened to \"destroy them like a fir\" if they did not. Not understanding Croesus\u0027 threat, but fearing him anyway, they released Miltiades.","level of digression":"2","section(s)":"6.37","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"The Argives are tricked.","x":-1808.308837890625,"y":305.8771667480469,"id":"103","attributes":{"summary":"Cleomenes noticed what the Argives were doing and told his men to take up arms as soon as the Argives had broken for dinner. Many Argives were slain this way, and the rest took refuge in the grove of Argus.","level of digression":"2","section(s)":"6.78","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Aeaces re-established.","x":207.74130249023438,"y":-2035.960693359375,"id":"30","attributes":{"summary":"The Phoenicians, having fought for Miletus, re-established Aeaces on the throne at the behest of the Persians. They also spared the Samians, and did not burn any cities or temples of people who submitted to them.","level of digression":"2","section(s)":"6.25","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"A race for Miltiades.","x":1765.2891845703125,"y":-1222.6611328125,"id":"48","attributes":{"summary":"When Miltiades died, the people of the Cheronses created a gynmicontest and a chariot-race in his honor. It was not lawful for a Lampsacenian to compete in them.","level of digression":"3","section(s)":"6.38.1b","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"The Catalogue of Suitors.","x":2068.42626953125,"y":1254.7073974609375,"id":"178","attributes":{"summary":"The catalogue of suitors.","level of digression":"5","section(s)":"6.127","commentary":"[Quaternary Digression]"},"color":"rgb(46,144,114)","size":12.0},{"label":"The oracle about Miletus is fulfilled.","x":-112.58122253417969,"y":-1914.0438232421875,"id":"19","attributes":{"summary":"The Persians, after winning the naval battle, layed seige to Miletus. Miletus was eventually defeated and enslaved. These events fulfilled an oracle made about Miletus.","level of digression":"1","section(s)":"6.18","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Catalogue of ships.","x":-1534.8179931640625,"y":-1824.71337890625,"id":"7","attributes":{"summary":"The number of ships brought by each people was as follows: Milesians (80 ships), Prieneans (12 ships), Myesians (3 ships), Teians (17 ships), Chians (100 ships), Erythraeans (8 ships), Phocaeans (3 ships), Lesbians (70 ships), Samians (on the western wing, with 60 ships). The total number of ships was 353 triremes.","level of digression":"1","section(s)":"6.8","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"The Athenian deaths.","x":345.4499816894531,"y":2090.17578125,"id":"158","attributes":{"summary":"Callimachus the Polemarch died in the battle, and so did many other famous Athenians. Cynaegirus, son of Euphorion, had his hand cut off and died.","level of digression":"2","section(s)":"6.114","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Archidamus dies young.","x":-1942.802978515625,"y":-23.401138305664062,"id":"92","attributes":{"summary":"Leotychides received the kingdom. He had a son named Zeuxidamus, who died young but left a son, Archidamus.","level of digression":"3","section(s)":"6.71","commentary":"[Secondary Digression] Zeuxidamus does not seem to have a crucial role in any ancient history, but is mentioned by Thucydides and Pausanias as well as Herodotus. Herodotus emphasizes here that Zeuxidamus never became the king of Sparta because he died before his father, Leutychides. Pausanias continues the history of the family of Zeuxidamus further, telling his reader that Archidamus had a son also named Zeuxidamus, and the son of Zeuxidamus the younger, Anaxidamus, came to the throne (3.7.6). Pausanias also specifies that Zeuxidamus the older died of disesase (3.7.10). Thucydides tells a story about Archidamus that the other two do not, describing a scene in which Archidamus destroys the countryside around Athens right before the Aegina plague (2.47.2)."},"color":"rgb(0,202,255)","size":12.0},{"label":"The oracle for Miletus.","x":-215.43495178222656,"y":-2038.933349609375,"id":"21","attributes":{"summary":"The prophecy given to the Milesians was about Miletus, who the oracle said would recieve many gifts, and his wives would \"wash the feet of many long-haired men.\"","level of digression":"3","section(s)":"6.19.2","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Ariston has a son, Demaratus.","x":-1065.5228271484375,"y":-567.2587280273438,"id":"80","attributes":{"summary":"Ariston\u0027s third wife had a child, Demaratus. Ariston questioned whether Demaratus was his son, but eventually decided that he was.","level of digression":"3","section(s)":"6.63.1-2","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Hippias\u0027 dream.","x":-1088.0301513671875,"y":1900.7662353515625,"id":"146","attributes":{"summary":"Hippias dreamed that he slept with his mother, and he interpreted the dream as saying that he would return to power in Athens and live to a ripe old age.","level of digression":"2","section(s)":"6.107.1b-2a","commentary":"[Primary Digression] In his Life of Julius Caesar, Suetonius records that Caesar similarly interpreted a dream about sleeping with his mother as a sign of his imminent dominance over many lands (Suet. Caes. 7). Dream sequences are a frequent form of digression in Herodotus, although in some cases Herodotus merely mentions the actions taken in response to a dream, rather than the events of the dream itself (c.f. the section \"Datis\u0027 vision.\")."},"color":"rgb(198,134,233)","size":12.0},{"label":"Lacedaemonians and Egyptians.","x":-721.6495361328125,"y":-600.677001953125,"id":"76","attributes":{"summary":"In one way the Lacedaemonians resembled the Egyptians. Their flute-players and cooks took their profession from their fathers.","level of digression":"6","section(s)":"6.60","commentary":"[Quinary Digression]"},"color":"rgb(255,92,129)","size":12.0},{"label":"Miltiades in the Chersonese.","x":-1461.6212158203125,"y":1707.40869140625,"id":"140","attributes":{"summary":"When Cimon died his eldest son Stesagoras was in the Chersonese with Miltiades his uncle. Miltiades son of Cimon was named after said uncle who founded the Chersonese, and he was in Athens at the time of his fathers death.","level of digression":"3","section(s)":"6.103.4b","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Scythas lives a long life.","x":297.2145080566406,"y":-2090.057861328125,"id":"29","attributes":{"summary":"Scythas escaped and fled to Himera. Darius liked Scythas. Scythas died a natural death in old age.","level of digression":"3","section(s)":"6.24","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Leotychides completes his warning.","x":821.36328125,"y":543.5549926757812,"id":"116","attributes":{"summary":"Leotychides finished his story of Glaucus by saying that, although Glaucus eventually returned the money to the Milesian man\u0027s sons, he left behind no living descendents because he had doubts about abiding by his pledge. This story, however, did not convince the Athenians.","level of digression":"2","section(s)":"6.86d","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Miltiades had ruled these cities before.","x":1284.4774169921875,"y":-1297.099365234375,"id":"40","attributes":{"summary":"Until the time the Persians took the cities of the Chersonese, the cities were ruled by Miltiades.","level of digression":"1","section(s)":"6.34.1","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Many die at Mount Athos.","x":857.651611328125,"y":-707.952880859375,"id":"57","attributes":{"summary":"Many Greek cities were captured, even those who did not try to defend themselves. From Thasos, the fleet tried to circle Mount Athos. 300 ships were destroyed by a storm around Athos, and more than 20,000 men died.","level of digression":"1","section(s)":"6.44","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Waters of the Styx","x":-2194.236328125,"y":185.14743041992188,"id":"96","attributes":{"summary":"The waters of the Styx were in the Arcadian city, dripping from a rock into a basin.","level of digression":"4","section(s)":"6.74.2","commentary":"[Tertiary Digression] Styx literally means \"shuddering.\" The river Styx is mentioned in several mythologies, notably Homer\u0027s Iliad and Odyssey and Hesiod\u0027s Theogony. It is because of Hesiod\u0027s description of the river that th Styx was believed to be in Arcadia: \"[Styx] lives apart from the gods in her glorious house vaulted over with great rocks and propped up to heave all round with silver pillars\" (Theogony 775)."},"color":"rgb(234,134,21)","size":12.0},{"label":"Persians \u0027net\u0027 the islanders.","x":778.521728515625,"y":-1502.9530029296875,"id":"37","attributes":{"summary":"To \u0027net\u0027 the men on each island, the Persians held hands in a long row that reached across the island. They then marched across the island and hunted the men.","level of digression":"2","section(s)":"6.31.2","commentary":"[Primary Digression] On this concept of a \u0027net\u0027, McQueen thinks that Herodotus is misinformed that this was done on these larger islands. \"In Plato, Menexenus 240C, Laws 698D, where the procedure is said to have been implemented at Eretria in 490, though in fact it can have been practised only on small islands with comparatively flat terrain. Larger islands like Lesbos and Chios coan hardly have been netted in the way Herodotus describes.\" (McQueen, 107)."},"color":"rgb(198,134,233)","size":12.0},{"label":"The Battle of Marathon continues.","x":312.8243103027344,"y":1986.875,"id":"157","attributes":{"summary":"The armies fought on the plane of Marathon. The Persians broke through the center line and began pursuing the Greeks, but the wings came around the back and caught the Persians. The Athenians and the Plateans caused the Persians to flee and broke their center. The Athenians chased them all down and set their ships on fire.","level of digression":"1","section(s)":"6.113","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"The Eretrians ask the Athenians for aid.","x":-874.3101196289062,"y":1256.41748046875,"id":"134","attributes":{"summary":"The Eretrians asked the Athenians for help, since they knew the Persian army was coming for them. The Athenians agreed to help and sent them troops. The Eretrians disagreed on what to do; some wanted to flee and some wanted to betray their fellow people to the Persians. They asked the Athenians to leave and go back.","level of digression":"1","section(s)":"6.100","commentary":"[Main Narrative] The Eretrians were going to flee into the peaks of the Euboean mountains, according to Hdt. McQueen notes \"only the peak of the Euboean Mt. Olympus which lies some 5 miles to the north east of Eretria, and the long ridge of Mt. Dirphys, which lies beyond Mt. Olympus and runs along the east coast, will have afforded any protection.\" (McQueen, 185). He seems to think that this plan wasn\u0027t the best one from the get go."},"color":"rgb(95,198,19)","size":12.0},{"label":"Hippoclides makes a fool of himself.","x":1184.992431640625,"y":882.7440795898438,"id":"180","attributes":{"summary":"On the day of Cleisthenes\u0027 descision, the suitors had a banquet with music and dancing. Hippoclides began to dance. He asked an attendant to bring him a table, which he first did Laconian steps on, then Attic and then put his head on the table and gestured in the air with his legs. Cleisthenes tried to hold himself back, but eventually became too angry and told Hippocleides to stop.","level of digression":"4","section(s)":"6.129","commentary":"[Tertiary Digression]"},"color":"rgb(234,134,21)","size":12.0},{"label":"Miltiades\u0027 son becomes Persian.","x":1375.7532958984375,"y":-1035.69384765625,"id":"54","attributes":{"summary":"Miltiades escaped with four ships and went to Imbrus. Miltiades\u0027 son is captured and taken to Darius. Darius gave Miltiades\u0027 son many gifts, including a house and a Persian wife. His children were considered Persians. Miltiades arrived in Athens.","level of digression":"2","section(s)":"6.41.2-4","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Histiaios is captured.","x":318.3027648925781,"y":-1778.8980712890625,"id":"33","attributes":{"summary":"Histiaios led an army against Thasos. Hearing that the Phoenicians were going to leave Miletus, Histiaios went to Lesbos and his army was very hungry. Harpagus, a Persian, kidnapped Histiaios.","level of digression":"1","section(s)":"6.28","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"The Athenians decide to fight.","x":-307.84588623046875,"y":2093.049560546875,"id":"153","attributes":{"summary":"Callimachus voted in favor of fighting, and all the generals who didn\u0027t want to fight gave their command to Miltiades. He accepted their positions, but did not engage battle until the day of his own command.","level of digression":"1","section(s)":"6.110","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Eginetans surrender.","x":-1919.864990234375,"y":140.804931640625,"id":"94","attributes":{"summary":"Cleomenes attacked the Eginetans with Leotychides. The Eginetans made no further resistance. Cleomenes and Leotychides picked the ten wealthiest men from Egina, including Crius and Casmbus, and took them to Attica. They gave them to the Athenians, who were great enemeis of the Eginetans.","level of digression":"2","section(s)":"6.73","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Brygi attack Mardonius.","x":673.9111328125,"y":-574.1367797851562,"id":"58","attributes":{"summary":"Mardonius and his army were attacked at night by the Brygi. Many Persians were slain, and Mardonius was wounded. Mardonius then subdued the Brygi. However, since the Brygi had reduced his numbers, Mardonius returned to Asia in disgrace.","level of digression":"1","section(s)":"6.45","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Miltiades\u0027 injury","x":1774.749267578125,"y":819.5072021484375,"id":"187","attributes":{"summary":"Miltiades was going to give up when a prisoner, a priestess named Timo, gave him advice on how to get in. Miltiades attempted to break into the temple, but became uncomfortable. When he was coming back out he strained his thigh.","level of digression":"3","section(s)":"6.134","commentary":"[Secondary Digression] How and Wells argue that this \"unfavorable view of Miltiades\u0027 motives and conduct\" is a Herodotean insertion originating in a prosecutorial speech made by Xanthippus against Miltiades (How and Wells, 121)."},"color":"rgb(0,202,255)","size":12.0},{"label":"Miltiades made king in the Chersonese.","x":1726.9984130859375,"y":-1516.10595703125,"id":"44","attributes":{"summary":"Miltiades left Athens and sailed away from the Dolonci. He arriveed in the Chersonese and was made king.","level of digression":"2","section(s)":"6.36.1","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Pheidippides runs the Marathon.","x":-1386.5489501953125,"y":1773.5391845703125,"id":"142","attributes":{"summary":"The Athenians sent a herald to Sparta named Pheidippides, who was a very skilled runner.","level of digression":"2","section(s)":"6.105.1a","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Leotychides discusses the oracle.","x":594.0313110351562,"y":577.3926391601562,"id":"115","attributes":{"summary":"Leotychides then described how Glaucus went to consult the oracle of Delphi, who told him that those who break promises would be met with death, and that even those who consider breaking promises are cursed.","level of digression":"2","section(s)":"6.86c","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"The story of Miltiades\u0027 father, Cimon.","x":-1326.9854736328125,"y":1676.3472900390625,"id":"138","attributes":{"summary":"Miltiades\u0027 father, Cimon son of Stesagoras, was banished from Athens by Pisistratus. Cimon won a four horse chariot race at Olympia, which Miltiades (his half brother) had done previously. Cimon won at the next Olympiad with the same Mares, and let Pisistratus be called winner if he was allowed to return to his home. Cimon won a thrid time with the same mares, and then was killed by Pisistratus\u0027 sons. Cimon was buried across from his mares.","level of digression":"2","section(s)":"6.103.2-3","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"The defeat of Naxos.","x":-333.628662109375,"y":644.1611938476562,"id":"129","attributes":{"summary":"The Persians attacked Naxos because they had previously failed to conquer the Naxians. This time, the Persians captured some of the Naxians and burned down all their temples.","level of digression":"1","section(s)":"6.96","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Darius \"remembers the Athenians.\"","x":-236.07986450195312,"y":173.77542114257812,"id":"126","attributes":{"summary":"Darius continued to look for an excuse to attack Greece.","level of digression":"1","section(s)":"6.94.1","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"The Athenian side.","x":2208.6767578125,"y":225.30108642578125,"id":"192","attributes":{"summary":"The Athenians said that the Pelasagians would sexually assault and harrass maidens who came into their territory to draw water at the fountain. The Athenians then said that the Pelasagians, once they had land, tried to attack Athens. The Athenians drove them out of Attica and they settled in Lemnos and other places.","level of digression":"4","section(s)":"6.137.3-4","commentary":"[Tertiary Digression]"},"color":"rgb(234,134,21)","size":12.0},{"label":"The Samians decide to sail away.","x":119.51593780517578,"y":-2166.3876953125,"id":"26","attributes":{"summary":"The Samians held a council, and the richer Samians were upset by the deals their captains made with the Medes. The Samians decided to not remain and become slaves of Aeaces, but rather to sail away and live elsewhere.","level of digression":"2","section(s)":"6.22.1","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Cleomenes and Crius.","x":-215.1351776123047,"y":-76.01581573486328,"id":"65","attributes":{"summary":"Cleomenes, king of the Spartans, went to Egina to seize the traitors. The Eginetins resisted, Crius especially.","level of digression":"1","section(s)":"6.50","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"The Persians land at Marathon.","x":-821.826416015625,"y":1931.8197021484375,"id":"147","attributes":{"summary":"Hippias led the Persians to leave the Eretrian prisoners on Aegileia, an island belonging to the Styreans. The Persians then anchored off of Marathon and disembarked.","level of digression":"1","section(s)":"6.107.2b","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"The end of the battle.","x":536.5720825195312,"y":1883.5516357421875,"id":"159","attributes":{"summary":"The Athenians captured seven vessels, and the remainder of the Persians fled. They got their Eretrian prisoners from their island and tried to reach Athens before the Athenians could get back.","level of digression":"1","section(s)":"6.115.1a","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Lemnian deeds.","x":2378.71240234375,"y":197.28550720214844,"id":"194","attributes":{"summary":"Wicked things in Greece were called \"Lemnian things\" because of these women, but also because Lemnian women killed their husbands in the days of Thaos.","level of digression":"4","section(s)":"6.138.4b","commentary":"[Tertiary Digression] There is another reference to the wickedness of the Lemnians in the story of Jason of and Argonauts. While in Herodotus\u0027 story the Pelasgians kill Athenian mothers and children, in Jason and the Argonauts the Pelasgian women kill Pelasgian men because the men were cheating on them with Thracian women. This is why Jason, on a quest for the golden fleece, arrives at the island that has been without men for many years. His sailers sleep with the women on the island and create the race of the Minyae."},"color":"rgb(234,134,21)","size":12.0},{"label":"Stesagoras dies childless.","x":1730.320556640625,"y":-1155.91650390625,"id":"49","attributes":{"summary":"Stesagoras also died childless. He was struck in the head with a hatchet by a man pretending to be an army deserter.","level of digression":"3","section(s)":"6.38.2","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Leotychides banished.","x":-1969.3914794921875,"y":52.3790168762207,"id":"93","attributes":{"summary":"Leotychides suffered something that avenges Demaratus. Leotychides made war against Thessaly, but was bribed with a lot of money not to conquer them. He was caught with a bribe, sitting in his tent with a bunch of silver. He was taken to trial and banished from Sparta, and his house was burned to the ground. He died in Tegea.","level of digression":"3","section(s)":"6.72","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"The Alcmaeonidae free Athens.","x":1554.215576171875,"y":1529.6839599609375,"id":"173","attributes":{"summary":"Herodotus sees the Alcmaeonidae as the liberators of Athens over Hamodius and Aristogeiton. The Almaeonidae supposedly convinced the Pythia to tell the Spartans to free Athens.","level of digression":"3","section(s)":"6.123.2","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Thasian mines.","x":725.332763671875,"y":-391.5592956542969,"id":"61","attributes":{"summary":"The Thasians were wealthy partly because of the revenue they made from the mines. Their mine at Scapte-Hyle produced 80 talents a year, and other mines also turned a profit.","level of digression":"3","section(s)":"6.46.3","commentary":"[Secondary Digression] According to McQueen, the Thasians were still wealthy enough in the 5th century from these mines and from agricultural production that they (along with Aegina) paid \"the highest tribute assessment (30 tal. per year) imposed on any member of the Delian League.\" (McQueen, 125)."},"color":"rgb(0,202,255)","size":12.0},{"label":"The Thasians are wealthy.","x":598.5140991210938,"y":-422.2565002441406,"id":"60","attributes":{"summary":"The Thasians had a lot of money, so when Histiaios attacked they had built stronger walls and more ships.","level of digression":"2","section(s)":"6.46.2","commentary":"[Primary Digression] How and Wells (citing Macan) observe that the these two surrenders by the Thasians may be the result of a dittograph, \"i.e. that [Herodotus] gives two accounts drawn from different sources of one surrender\" (How and Wells, 81). Another explanation may be that the accending tripartide digression series begun here enables Herodotus to distract the reader from the absence of a logical explanation of the Thasians\u0027 change of heart through the main narrative."},"color":"rgb(198,134,233)","size":12.0},{"label":"The Captive Eretrians.","x":1142.177978515625,"y":1617.892822265625,"id":"165","attributes":{"summary":"The Eretrians who had been captured were taken to Susa. King Darius did not like the Eretrians before they were his prisoners, but now that they were under his rule he did not harm them but settled them in Cissia at Ardericea. They were close to a very special well.","level of digression":"2","section(s)":"6.119.1-2","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"The Pelasgian side.","x":2205.511962890625,"y":306.29833984375,"id":"191","attributes":{"summary":"According to Hecataeus, the Athenians gave the Pelasagians some land that they thought was barren. The Pelasagians restored it and when the Athenians saw it they wanted it back, so they drove them out and took it.","level of digression":"4","section(s)":"6.137.2","commentary":"[Tertiary Digression]"},"color":"rgb(234,134,21)","size":12.0},{"label":"The order of the Athenians.","x":99.42739868164062,"y":2061.885498046875,"id":"154","attributes":{"summary":"On the day of his command, the Athenians got into formation. Callimachus led the right wing. The tribes were in an unbroken line and the Plateans were on the left wing. They were dispersed so that their army would be equal in length to the Persians. The center line was weaked, but the wings had depth of ranks.","level of digression":"1","section(s)":"6.111","commentary":"[Main Narrative] In this section Herodotus says the tribes were arranged \"according to numerical order\", which McQueen thinks is strange. \"Herodotus may have been referring to the official order of the ten tribes as established by Cleisthenes\u0027 reforms, though in this ievent it is not at all clear why Aeantis (the 9th tribe) should have been on the extreme right unless it was because Aeantis was the tribe to which the polemarch himself belonged.\" (McQueen, 199). McQueen goes on to cite Plutarchs order of the tribes in this instance, which seems to be less believable than Herodotus simply due to each authors chronological proximity to the events at Marathon."},"color":"rgb(95,198,19)","size":12.0},{"label":"Pheidippides reaches Sparta.","x":-1240.2864990234375,"y":1807.203125,"id":"144","attributes":{"summary":"Pheidippides reached Sparta the day after the Pan encounter and when the rulers asking them to aid the Athenians. The Spartans were unable to help, even though they wanted to, because they could not march without the full moon.","level of digression":"2","section(s)":"6.106","commentary":"[Primary Digression] McQueen, and others, are angry with Herodotus for making this statement that the Spartans could not march until the moon was full. According to McQueen, the Spartans could have been engaged in a festival which legally prevented them from leaving. He also adds, citing Plato, that they could have been dealing with a helot revolt. Apparently Herodotus\u0027 failure to mention these complications is a sign of his indifference to the Spartans. McQueen thinks that they probably left as soon as they could, given that they arrive in Athens so soon after the conclusion of the battle. (McQueen, 192)."},"color":"rgb(198,134,233)","size":12.0},{"label":"Origins of Lacedaemonian dual-kingship.","x":-526.6019897460938,"y":-282.3885498046875,"id":"67","attributes":{"summary":"The Lacedaemonians claim they came to their land because of king Aristodemus. Aristodemus\u0027 wife gave birth to twins, and Aristodemus himself died soon after. The Lacedaemonians decided that day that their king should be the elder of the two children, but they couldn\u0027t tell which one was older. They trick Aristodemus\u0027 wife into revealing the truth. The oldest boy was called Eurysthenes, and the youngest was called Procles. There was enmity between them for their whole lives that continues to this day.","level of digression":"3","section(s)":"6.52","commentary":"[Secondary Digression] How and Wells call this account a \"clumsy fiction,\" meant to explain a double kingship that actually arose as a result of the Dorian invasion or some other political cause, rather than a personal one (How and Wells, 82). However, Herodotus does consistently maintain this narrative over the course of the lengthy primary digression path (c.f. the section \"Rights of the Spartan kings in peace.\")."},"color":"rgb(0,202,255)","size":12.0},{"label":"Miltiades\u0027 fame grows.","x":1362.1826171875,"y":1243.8900146484375,"id":"183","attributes":{"summary":"After his defeat of the Persians, Miltiades became famous in Athens. He requested ships, an army, and funds to go to war without telling the others who he was waging war on. The Athenians agreed because he said it would make them rich.","level of digression":"1","section(s)":"6.132","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Why Miltiades attacks Lemnos.","x":2161.079833984375,"y":385.52203369140625,"id":"190","attributes":{"summary":"The Athenians drove some Pelasgians out of Attica. Hecataeus said in his history that this was unjust.","level of digression":"3","section(s)":"6.137.1","commentary":"[Secondary Digression] This digressive episode about the Pelasgians as antagonistic to the Athenians contrasts with the manner in which Herodotus has previously portrayed the Pelasgians as the original ethnic group from which the Athenians arose (Hdt. 1.56-8). Sourvinou-Inwood contests that these differing acounts of the Pelsgians are easily reconcilable once one discards the notion that ethnicity is unchanging, but Herodotus fails to connect the pieces by leaving out any account of the shift by which some Pelasgians became Athenian (and therefore Greek), while others remained non-Greek-speaking and settled in Lemnos."},"color":"rgb(0,202,255)","size":12.0},{"label":"The Carystian resistance.","x":-753.1749877929688,"y":1123.45849609375,"id":"133","attributes":{"summary":"The Persians took children as hostages from other Greek islands, but when they came to Carystus, the Carystians refused to give up children and would not fight against Athens and Eretria. The Persians laid seige to their town until they obeyed.","level of digression":"1","section(s)":"6.99","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Rights of the Spartan kings in peace.","x":-494.7709045410156,"y":-669.9351196289062,"id":"73","attributes":{"summary":"Both Spartan kings were given the privilege of the first seat at banquets, and they were served first a double-portion. They also got the hides of sacrificed beasts. These same privileges applied to private dinners that the kings attend. They also had custody of all oracles. The kings decided whom an heiress should marry if her father died, and wielded special voting privileges. If they were absent from the senate, their nearest kin among the senators voted in their place.","level of digression":"5","section(s)":"6.57","commentary":"[Quaternary Digression] How and Wells observe that, assuming that the Herodotean account of the origin of the Spartan double-kingship from twin brothers must be false, the senators who are nearest relatives to the kings would not be the same for each king (How and Wells, 87). This type of continuity of narrative pulls the digressive episode together, showing Herodotus as a scholarly synthesizer rather than simply a compiler of facts."},"color":"rgb(46,144,114)","size":12.0},{"label":"The Athenians beat the Persians to Athens.","x":735.4574584960938,"y":1777.24560546875,"id":"161","attributes":{"summary":"The Athenians reached Athens before Persia, and since they had previously camped at the Heraklea in Marathon, they now camped at the Heraklea in Cynosarges. The Persians arrived and stayed outside of the Phalerum, but then departed back to Asia.","level of digression":"1","section(s)":"6.116","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"An oracle for Cleomenes.","x":-2177.284912109375,"y":536.5316162109375,"id":"99","attributes":{"summary":"Cleomenes had once been told by the oracle that he should take Argos, so he led the Spartans to the river Erasinus.","level of digression":"4","section(s)":"6.76.1a","commentary":"[Tertiary Digression]"},"color":"rgb(234,134,21)","size":12.0},{"label":"The name Demaratus.","x":-1122.8233642578125,"y":-643.31982421875,"id":"81","attributes":{"summary":"Ariston chose the name Demaratus because he had prayed for his son.","level of digression":"4","section(s)":"6.63.3","commentary":"[Tertiary Digression]"},"color":"rgb(234,134,21)","size":12.0},{"label":"Miltiades dies childless.","x":1680.82421875,"y":-1267.9459228515625,"id":"47","attributes":{"summary":"Miltiades died childless, leaving his kingdom to Stesagoras. Stesagors was the son of Cimon, the half-brother of Miltiades.","level of digression":"2","section(s)":"6.38.1a","commentary":"[Primary Digression] Miltiades was the founder of this city in the Chersonese, and according to custom \"the founder of the city was regarded as more than mortal and, as the city\u0027s greatest benefactor, received heroic honors after death.\" McQueen goes on to discuss some other common practices on the anniversary of the death of the founder, including the funeral games later mentioned. (McQueen, 115)."},"color":"rgb(198,134,233)","size":12.0},{"label":"Eginetans are traitors.","x":31.08534049987793,"y":-188.859130859375,"id":"64","attributes":{"summary":"The mainlanders and islanders all send earth and water to King Darius. The Athenians, hearing that the Eginetans had done so, declared that the Eginetans were traitors to Greece.","level of digression":"1","section(s)":"6.49","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"The labours of the Plateans.","x":-756.532470703125,"y":2124.349853515625,"id":"150","attributes":{"summary":"The Plateans were being harassed by the Thebans, so they asked the Lacedaemonians to help them if they surrendered themsleves to their rule. The Spartans refused, saying that they were too far away to be much help and that the Plateans should ask the Athenians. The Spartans said this hoping to get the Athenians to go to war with the Boetians.","level of digression":"2","section(s)":"6.108.2-3","commentary":"[Primary Digression] \"Thebes as the largest city in Boeotia had throughout her history thought to assert a domination over the other cities through the medium of a federated state (the Boetian Confederacy), in which she enjoyed a predominant voice. The other cities were frequently coerced into mempership, and could stay aloof only with outside support. A period of intense Theban pressure on the other Boeotian communities seems to have begun in the 520s.\" (McQueen, 194). On this subject, McQueen is citing the book A History of Boeotia, by R.J. Buck."},"color":"rgb(198,134,233)","size":12.0},{"label":"Temple at Didyma is burnt.","x":-89.40748596191406,"y":-2127.306884765625,"id":"22","attributes":{"summary":"Many Milesians were killed by the Persians, who have long hair. The temple at Didyma was plundered and then burned down. This temple was very wealthy.","level of digression":"2","section(s)":"6.19.3","commentary":"[Primary Digression] Didyma was \"the sight of the most famous oracle of Apollo in Ionia, situated some 10 miles to the south of Miletus and controlled, until the time of the Ionian Revolt, by a clan of priests known as the Branchidae, who claimed descent from Apollo\u0027s son Branchus.\" Callisthenes attributes the burning of the temple to the Brachnidae, saying that they later moved to Sogdiana where their descendents met Alexander the Great. Apparently another commentator named Parke believes that \"Callisthenes\u0027 account originated with the Milesians in Alexander\u0027s army who sought to blacken the Branchidae lest Alexander restore them to their former position of authority at Didyma.\" Others don\u0027t even believe that the Branchidae existed long enough to meet Alexander. (McQueen, 98-99)."},"color":"rgb(198,134,233)","size":12.0},{"label":"New Spartan kings forgive debts.","x":-608.540771484375,"y":-505.4930725097656,"id":"75","attributes":{"summary":"When a new Spartan king took the throne, he forgave all the debts that Spartans owed the king or the treasury.","level of digression":"5","section(s)":"6.59","commentary":"[Quaternary Digression]"},"color":"rgb(46,144,114)","size":12.0},{"label":"Leotychides begins a story.","x":133.16932678222656,"y":645.5438232421875,"id":"113","attributes":{"summary":"Leotychides began speaking to the Athenians, telling them about how a man named Glaucus, who had lived in Sparta, had recieved money from a man of Miletus on the promise that Glaucus would return it to anyone who brought the receipts.","level of digression":"2","section(s)":"6.86a","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Demaratus goes to Darius.","x":-1831.5328369140625,"y":-57.610408782958984,"id":"91","attributes":{"summary":"Demaratus journied to Elis, pretending to go to Delphi. The Lacedaemonians chased him, but Demaratus sailed to Zacynthus. The Zacynthians would not give up Demaratus, who fled and presented himself to Darius. Darius gave him lands and cities.","level of digression":"2","section(s)":"6.70","commentary":"[Primary Digression] In Book VII, Demaratus defends the Greeks even though he has been exiled, saying that he \"admire[s] all the Greeks who live in those Dorian lands\" (VII.104)."},"color":"rgb(198,134,233)","size":12.0},{"label":"Demaratus desposed.","x":-1655.5006103515625,"y":-190.6688690185547,"id":"87","attributes":{"summary":"Demaratus was desposed in this way, but he went to Medes on account of another affront.","level of digression":"2","section(s)":"6.67.1","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Eretria is sacked by the Persians.","x":-988.256591796875,"y":1387.5234375,"id":"135","attributes":{"summary":"The Athenians left Eretria to escape the approaching Persians. The Persians landed in Eretria and battle was joined. Two Eretrians betrayed the rest to the Persians, and the city was sacked and the citizens captured.","level of digression":"1","section(s)":"6.101","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Cleomenes at the river.","x":-2058.1455078125,"y":498.2198486328125,"id":"101","attributes":{"summary":"Cleomenes, having arrived at the river, offered sacrifice to it. His victims were not favorable to crossing. He withdrew his troops and led them to Thyrea.","level of digression":"4","section(s)":"6.76.1c-2","commentary":"[Tertiary Digression]"},"color":"rgb(234,134,21)","size":12.0},{"label":"Alcmaeon\u0027s reward.","x":1817.1351318359375,"y":1321.648193359375,"id":"176","attributes":{"summary":"When Croesus the Lydian sent men to consult the oracle at Delphi, Alcmaeon son of Megacles helped them. Croesus was greatful and invited him to Sardis, where he said he could take as much gold as he could carry home with. Alcmaeon manipulated his boots and tunic so that they could hold as much gold as possible and covered his hair and face in gold dust. He also stuffed some in his mouth. He then could barely leave the building, and Croesus burst out laughing when he saw him. Croesus gave all the gold to Alcmaeon, along with some others, and that is how they became rich.","level of digression":"4","section(s)":"6.125.2-5","commentary":"[Tertiary Digression]"},"color":"rgb(234,134,21)","size":12.0},{"label":"Thasians plan a revolt.","x":462.4603271484375,"y":-456.6428527832031,"id":"59","attributes":{"summary":"Darius heard that the Thasians were planning a revolt. He sent a herald and demanded they take down their walls and bring their ships in Abdera.","level of digression":"1","section(s)":"6.46.1","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"The suitors compete.","x":1100.7342529296875,"y":712.50146484375,"id":"179","attributes":{"summary":"The suitors came to Siciyon and Cleisthenes tested them on their lineage and homeland. For a year, he tested them on their disposition, accomplishments and conversed with them. He also entertained them in banquets. His favorite was Hippoclides from Athens.","level of digression":"4","section(s)":"6.128","commentary":"[Tertiary Digression]"},"color":"rgb(234,134,21)","size":12.0},{"label":"Ionians become slaves (again).","x":979.0791625976562,"y":-1470.760498046875,"id":"38","attributes":{"summary":"The Persians, when they took a city, made the best boys into eunuchs and took the best girls for the king. They burned the cities and temples. This was the third time the Ionians were reduced to slavery (twice by the Lydians, and now by the Persians).","level of digression":"1","section(s)":"6.32","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Scythian fashion.","x":-643.3839111328125,"y":667.972412109375,"id":"110","attributes":{"summary":"The Spartans referred to drinking unmixed wine as the \"Scythian fashion.\"","level of digression":"3","section(s)":"6.84.3b","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Ceres the Lawgiver doesn\u0027t lend a hand.","x":1576.8702392578125,"y":-53.528987884521484,"id":"123","attributes":{"summary":"The wealthy Eginetans captured seven hundred of the rebels and they were leading them out to be executed when one man escaped. He fled to the temple of Demeter the Lawgiver and grasped the doorhandles, but his captors cut off his hands.","level of digression":"3","section(s)":"6.91.1b","commentary":"[Secondary Digression] Demeter (Ceres for the Romans) had a santurary on Naxos, built around 530 BCE. Herodotus also describes the cutting off of the hands of a suppliant an impious act, saying that a \"curse befell them\" for doing such as thing."},"color":"rgb(0,202,255)","size":12.0},{"label":"The Alcmaeonidae hate tyrants.","x":1503.21044921875,"y":1465.5421142578125,"id":"172","attributes":{"summary":"The Alcmaeonidae hated tyrants. They stayed out of Athens in exile while tyrants were in power and they were the ones who dethroned the sons of Pisistratus.","level of digression":"2","section(s)":"6.123.1","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Origins of Cleomenes\u0027 madness.","x":-2226.796875,"y":450.61126708984375,"id":"98","attributes":{"summary":"Generally, the Greeks thought that Cleomenes went mad because he had bribed an oracle. The Athenians, however, said it was because he cut down the sacred grove of the goddesses during an invasion.","level of digression":"4","section(s)":"6.75.3b","commentary":"[Tertiary Digression]"},"color":"rgb(234,134,21)","size":12.0},{"label":"Cleomenes drinks unmixed wine.","x":-599.4478759765625,"y":615.7975463867188,"id":"109","attributes":{"summary":"Cleomenes countrymen said that his madness was not from burning down the grove, but rather because he often drank unmixed wine. He learned to drink unmixed wine from the Scyths.","level of digression":"2","section(s)":"6.84.1-3a","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Cleomenes charged with bribery.","x":-1016.7407836914062,"y":549.39892578125,"id":"107","attributes":{"summary":"Cleomenes was brought up on charges that he had been bribed, and therefore had not been able to easily take Argos. Cleomenes cleared himself of these charges.","level of digression":"2","section(s)":"6.82","commentary":"[Primary Digression] Cleomenes, to defend himself, claims that when he was trying to make a sacrifice to Hera, Hera told him that buring the grove of Argus was enough. This is also considered a prime example of the religiousity of the Spartans (Sparta: Comparative Approaches 257)."},"color":"rgb(198,134,233)","size":12.0},{"label":"No further comment on the Dorians.","x":-499.3837890625,"y":-448.3211669921875,"id":"71","attributes":{"summary":"Herodotus does not want to comment on how the Egyptians obtained the kingdoms of the Dorians.","level of digression":"4","section(s)":"6.55","commentary":"[Tertiary Digression] Herodotus refuses to comment on this issue because he asserts that other authors have elsewhere addressed the question; however, Herodotus, at other times, does retell stories that other authors have related before (How and Wells, 84). Perhaps Herodotus wants to avoid a digression which would take him even further from the path of the main narrative."},"color":"rgb(234,134,21)","size":12.0},{"label":"Demartus brings charges against Cleomenes.","x":-457.22491455078125,"y":-223.03810119628906,"id":"66","attributes":{"summary":"Demartus was bringing up charges against Cleomenes in Sparta. Demartus was the Spartan king of the lower house.","level of digression":"2","section(s)":"6.51","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Callias\u0027 accomplishments.","x":1433.23583984375,"y":1780.042236328125,"id":"171","attributes":{"summary":"Callias was very loyal to Athens. At the Olmpic games he won many prizes in horse racing, as well as at the Pythian games. Callias also let his three daughters choose their own husbands.","level of digression":"4","section(s)":"6.122","commentary":"[Tertiary Digression] This passage is widely considered to be a later interpolation not in the original text. How and Wells list the following reasons: it is not present in \"the best family\" of manuscripts, the narrative flows more cleanly without it, Plutarch does not criticize it, and its word and phrase choice are not Herodotean (How and Wells, 115)."},"color":"rgb(234,134,21)","size":12.0},{"label":"Rights of the Spartan kings in war.","x":-489.60345458984375,"y":-563.5270385742188,"id":"72","attributes":{"summary":"Both Spartan kings were given the right to make war on whatever country they wish. They marched first in battle, and retreated last. They had 100 men as their body guard, and could sacrifice as many cattle as they wanted for their expeditions.","level of digression":"5","section(s)":"6.56","commentary":"[Quaternary Digression]"},"color":"rgb(46,144,114)","size":12.0},{"label":"The Persian fleet takes many cities.","x":1125.1390380859375,"y":-1385.48486328125,"id":"39","attributes":{"summary":"The Persian fleet took all the towns on the left of the Hellespont (as one sails into the straits). The cities on the right had already been taken by the army on land. The Persians subdued all the cities in the Chersonese except Cardia.","level of digression":"1","section(s)":"6.33","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Pheidippides hears a message from Pan.","x":-1526.041015625,"y":1865.806884765625,"id":"143","attributes":{"summary":"When Pheidippides was running past Mount Parthenium he meets the god Pan, who asked why the Athenians had neglected him when he always helped them. When the Athenians heard this they set up a temple to Pan under the Acropolis and gave him a festival every year.","level of digression":"3","section(s)":"6.105.1b-3","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Demaratus, throned and de-throned.","x":-1082.9293212890625,"y":-471.579833984375,"id":"82","attributes":{"summary":"Ariston died and Demaratus recieved the kingdom. Cleomenes stripped him of his kingship.","level of digression":"3","section(s)":"6.64","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Cleisthenes of Sicyon.","x":1956.9903564453125,"y":1290.4190673828125,"id":"177","attributes":{"summary":"The generation after Alcmaeon, Cleisthenes of Sicyon had a daughter named Agariste. He wished to find her the best possible husband. He hosted an event, saying that whichever man thought himself worthy of being his son-in-law should come to Sicyon.","level of digression":"4","section(s)":"6.126","commentary":"[Tertiary Digression]"},"color":"rgb(234,134,21)","size":12.0},{"label":"The Chians had been warned.","x":116.80738830566406,"y":-1810.2999267578125,"id":"32","attributes":{"summary":"The Chians had been warned bad things would happen to them. Recently, they had sent a hundred youths to Delphi, but only two had returned alive. There were other signs as well.","level of digression":"2","section(s)":"6.27","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Egina\u0027s victory.","x":-139.7090301513672,"y":327.4956359863281,"id":"125","attributes":{"summary":"The Eginetans attacked the Athenian fleet and captured four ships.","level of digression":"2","section(s)":"6.93","commentary":"[Primary Digression] As How and Wells note, \"the story breaks off short\" at this point (How and Wells, 101). In particular, Herodotus provides no detail of how the Eginetans defeated the Athenains on land."},"color":"rgb(198,134,233)","size":12.0},{"label":"An earthquake in Delos.","x":-624.8801879882812,"y":980.6604614257812,"id":"131","attributes":{"summary":"Datis and the army left Delos in order to sail against Eretria, and Delos was shaken by an earthquake, an omen of the sorrows about to befall Greece during the reign of the next three Persian kings: Darius, Xerxes, and Artaxerxes.","level of digression":"1","section(s)":"6.98.1-3a","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"The Athenian generals decide weather or not to fight.","x":-519.61376953125,"y":2030.80712890625,"id":"152","attributes":{"summary":"The Athenian generals could not decide weather or not to engage in battle with the Persians. The Polemarch, Callimachus of Aphidnae, had the deciding vote. Miltiades convinced him to vote to join battle with the Persians.","level of digression":"1","section(s)":"6.109","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Samian ships do not flee.","x":-748.981201171875,"y":-1760.4404296875,"id":"15","attributes":{"summary":"The captains of the eleven Samian ships decided not to flee because they were not cowards. They were later rewarded for their bravery and their names were inscribed on pillars in the Samian marketplace.","level of digression":"2","section(s)":"6.14.3","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Leotychides hates Demaratus.","x":-1058.6053466796875,"y":-317.0641784667969,"id":"84","attributes":{"summary":"Leotychides hated Demaratus because Demaratus had stolen the woman he wanted to marry.","level of digression":"3","section(s)":"6.65.2","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Milesians and Sybarites are good friends.","x":113.16471862792969,"y":-2271.654052734375,"id":"24","attributes":{"summary":"When Sybaris was taken, the Milesians mourned. The Milesians and Sybarites were good friends.","level of digression":"2","section(s)":"6.21.1","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Hippias son of Pisistratus.","x":-979.0582275390625,"y":1840.83935546875,"id":"145","attributes":{"summary":"The Persians were led by Hippias son of Pisistratus who had a very strange dream.","level of digression":"1","section(s)":"6.107.1a","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Logic of the shield conspiracy.","x":1453.6373291015625,"y":1387.9896240234375,"id":"174","attributes":{"summary":"The Alcmaeonidae could not have held up the shield, even if they were offended by their fellow Athenians, because no other family was so honored as them. Someone did hold up a shield, but it was not the Alcmaeonidae.","level of digression":"2","section(s)":"6.124","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"Cleomenes kills the survivors.","x":-1612.2674560546875,"y":385.20526123046875,"id":"104","attributes":{"summary":"Cleomenes knew the name of each Argive surivor, and summoned them individually on the pretense of having received their ransoms. Cleomenes killed them instead, but eventually the Argives realized the trap.","level of digression":"2","section(s)":"6.79","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"The Milesians are settled by the Red Sea.","x":-70.73110961914062,"y":-2236.784912109375,"id":"23","attributes":{"summary":"King Darius did not harm the captive Milesians, but instead settled them by the Red Sea.","level of digression":"2","section(s)":"6.20","commentary":"[Primary Digression] See commentary for section 6.3, \"resettling\" as a common practice. Additionally, McQueen notes that the Milesians were still in the area in 479, according to Hdt. 9.99.3, 9.104.1. \"if the deportation of the Milesians was as thorough as Herodotus, why were there still Milesians in the area in 479, when they were ordered by the Persians to guard the passes to Mt. Mycale? Presumably the historian is guilty of some exaggeration, and only the more nationalisitc Milesians were in fact deported.\" (McQueen,99). This descrepency pointed out by McQueen raises interesting questions about resettlement. How many Milesians were left behind and why?"},"color":"rgb(198,134,233)","size":12.0},{"label":"His mother replies.","x":-1895.06640625,"y":-156.4715118408203,"id":"90","attributes":{"summary":"Demaratus\u0027 mother told him he was either the son of Ariston or the hero Astrabacus.","level of digression":"3","section(s)":"6.69","commentary":"[Secondary Digression] Pausanias also mentions Astrabacus, telling his reader that the \"hero-shrine of Astrabacus\" is near Salamis (Pausanias 3.16.6). Pausanias also tells us that Astrabacus and Alopecus (sons of Irbus, son of Amphisthenes, son of Amphicles, son of Agis) were taken with madness when they discovered the wooden image in Orthia, which is the image that \"once Orestes and Iphigenia stole out of the Tauric land.\" (Pausanias 3.16.19, 7)."},"color":"rgb(0,202,255)","size":12.0},{"label":"Cleomenes dies a madman.","x":-2188.93603515625,"y":336.4189147949219,"id":"97","attributes":{"summary":"Fearing the new plots of Cleomenes, the Lacedaemonians agreed that Cleomenes should be king again. Cleomenes returned, but had been taken by madness. He struck every person he met in the face with his sceptre. His kin imprison him, but, obtaining a knife from his guard, Cleomenes disfigured himself. Cleomenes died.","level of digression":"3","section(s)":"6.75.1-3a","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Cleomenes flees to Thessaly.","x":-2077.73974609375,"y":219.82211303710938,"id":"95","attributes":{"summary":"Cleomenes\u0027 plotting to depose Demaratus was revelaed, and Cleomenes fled to Thessaly. He then started to stir up trouble in Arcadia and tried to unite the Arcadians against Sparta. He bound the Arcadians with various oaths, and swore his own cause by the waters of the Styx.","level of digression":"3","section(s)":"6.74.1","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"The Persians approach Athens.","x":-1087.782958984375,"y":1524.849853515625,"id":"136","attributes":{"summary":"The Persians set sail for Attica. The Athenians were frightened to meet the same fate as the Eretrians. The Persians prepared to land at Marathon where there was space for their calvary.","level of digression":"1","section(s)":"6.102","commentary":"[Main Narrative] McQueen notes that Hippias, son of Peisistratus, (who was the one leading them to Marathon) would have chosen this location for reasons not only related to space for the calvary. Hippias (a former tyrant) \"would have been restored to power in the event of a Persian vctory, was popular in the area and could expect to attract a good deal of local support.\" Apparently Peisistratus \"landed at Marathon when he finished his thrid period of tyranny in 546 (Hdt. 1.62.1).\" (McQueen, 187)."},"color":"rgb(95,198,19)","size":12.0},{"label":"The remaining Chians are killed.","x":-492.0049133300781,"y":-1726.026123046875,"id":"17","attributes":{"summary":"The remaining Chian ships were pursued, so they put to shore at Mycale and travelled on foot. They came into the territory of the Ephesians, who were celebrating Thesmophoria and assumed them to be bandits. The remainder of the Chians were killed by the Ephesians.","level of digression":"2","section(s)":"6.16","commentary":"[Primary Digression] McQueen tells us that \"the Thesmophoria was a festival to Demeter, who was often worshipped with the cult title Thesmophoros (\u0027the Bringer of Justice\u0027) and celebrated over much of the Greek world, often open only to women.\" (McQueen, 97)."},"color":"rgb(198,134,233)","size":12.0},{"label":"The Zanclaeans want to found a city.","x":361.7656555175781,"y":-2201.570068359375,"id":"27","attributes":{"summary":"The Zanclaeans sent ambassadors to the Ionians. They wanted to found a city in Kale-Acte, or the Fair Strand. Kale-Acte was in Sicily. Only the Samians accepted this offer.","level of digression":"3","section(s)":"6.22.2","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Greeks and Persians at Malena.","x":480.1318359375,"y":-1707.117431640625,"id":"34","attributes":{"summary":"The Greeks and Persians battled at Malena. The Greeks and Histiaios fled. A Persian persued Histaios, who, upon being captured, spoke his own name.","level of digression":"1","section(s)":"6.29","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Miltiades rules the Chersonese.","x":1609.7294921875,"y":-1091.071533203125,"id":"51","attributes":{"summary":"Miltiades arrived in the Chersonese and stayed shut up in the house, pretending to mourn his brother. When people came to console him, he had them captured and thrown in prison. He thus made himself master of the Cheronese and married Hegesipyla.","level of digression":"3","section(s)":"6.39.2","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"The deaths at Marathon.","x":950.083984375,"y":1648.629150390625,"id":"162","attributes":{"summary":"6,400 of the Persians died at Marathon. 192 Athenians died at Marathon","level of digression":"1","section(s)":"6.117.1","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"The Spartans come to Marathon.","x":1148.593017578125,"y":1499.179443359375,"id":"167","attributes":{"summary":"On the full moon, the Spartans came to Marthon hoping to join the battle but their journey took them three days.","level of digression":"1","section(s)":"6.120.1a","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Dionysius gives a speech.","x":-1108.267578125,"y":-1957.922119140625,"id":"10","attributes":{"summary":"Dionysius adressed the Ionians at Lade. He told them that they had a choice to be free or be enslaved, and that if they were willing to work hard and be disciplined they would remain free.","level of digression":"1","section(s)":"6.11","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"The head of Histiaios.","x":647.0516967773438,"y":-1630.83544921875,"id":"35","attributes":{"summary":"If Histiaios had gone before King Darius, he would be okay. Artaphernes and Harpagus, however, kill him. They embalmed his head and sent it to Darius in Susa. Darius is mad they did not bring Histiaios alive, and has the head washed and buried.","level of digression":"1","section(s)":"6.30","commentary":"[Main Narrative] In this section, Histiaios is \"impaled\". McQueen notes the interesting usage of the word σταυρος, which means \"stake\". \"It was only in Roman times that the noun came to mean \u0027cross\u0027 and the corresponding verb...\u0027crucify\u0027. Impalement was a common form of punishment in Achaemenid Persia.\" (McQueen, 107)."},"color":"rgb(95,198,19)","size":12.0},{"label":"The Persians take the islands.","x":811.3388061523438,"y":-1552.83544921875,"id":"36","attributes":{"summary":"The Persians wintered at Miletus, and then attacked Chios, Lesbos, and Tenedos without much difficulty. They netted the inhabitants of each island.","level of digression":"1","section(s)":"6.31.1","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Darius appoints new generals.","x":-120.19076538085938,"y":205.32217407226562,"id":"127","attributes":{"summary":"Darius removed the command from Mardonius and appointed Datis and Artaphernes instead, commanding them to capture Athens and Eretria.","level of digression":"2","section(s)":"6.94.2","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0},{"label":"The Pelasagians suffer the consequences.","x":2350.8056640625,"y":115.96116638183594,"id":"195","attributes":{"summary":"After killing all their women and children, the Pelasagians were having issues with their herds and agriculture. They sent men to Delphi to ask what happened, and Pythia told them that the Athenians must be given satisfaction. The Athenians said that they must give them Lemnos. The Pelasagians said that they would when a ship could sail on a north wind from Athens to Lemnos, which was impossible for Attica is south of Lemnos.","level of digression":"3","section(s)":"6.139","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Cleisthenes makes a descision.","x":1259.315185546875,"y":1072.2681884765625,"id":"181","attributes":{"summary":"Cleisthenes addressed the suitors and told them that they would all be rewarded for their participation. He decided to marry Agariste to Megacles, son of Alcmaeon.","level of digression":"4","section(s)":"6.130","commentary":"[Tertiary Digression]"},"color":"rgb(234,134,21)","size":12.0},{"label":"The deposed Ionian tyrants gather.","x":-1432.7208251953125,"y":-1859.03173828125,"id":"8","attributes":{"summary":"The foreigners had about 600 ships. The tyrants of the Ionians, who had been deposed by Aristagoras, were gathered and given a rallying speech.","level of digression":"1","section(s)":"6.9","commentary":"[Main Narrative] In this section, Herodotus does not mention the Persian commander by name, which is unusual for him. According to McQueen, \"it is possible that he was Datis, who subsequently commanded in the Marathon campaign.\" (McQueen, 90). If Datis was commanding the Persians for this battle, however, it is strange that Herodotus does not mention him because Herodotus goes into several digressions later in book 6 concerning Datis."},"color":"rgb(95,198,19)","size":12.0},{"label":"Demaratus questions his mother.","x":-1877.536376953125,"y":-267.4424743652344,"id":"89","attributes":{"summary":"Demaratus demanded his mother tell him who his father truly was.","level of digression":"3","section(s)":"6.68","commentary":"[Secondary Digression]"},"color":"rgb(0,202,255)","size":12.0},{"label":"Mardonius establishes democracies.","x":1034.869873046875,"y":-840.4065551757812,"id":"56","attributes":{"summary":"Darius sent Mardonius, who had recently married Artazostra, down the coast. Mardonius voyaged down the coast of Asia and came to Ionia. Mardonius put down all the despots throughout Ionia and established democracies instead. He then went to the Hellespont and went across Europe against Eretria and Athens.","level of digression":"1","section(s)":"6.43","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Histiaios kills many Chians.","x":171.51304626464844,"y":-1882.5640869140625,"id":"31","attributes":{"summary":"Histiaios hears what happened to Miletus. He places someone else in charge of the Hellespont and sets sail for Chios. Histiaios kills many people at the \"The Hollows,\" and with the Lesbians\u0027 help kills many more.","level of digression":"1","section(s)":"6.26","commentary":"[Main Narrative]"},"color":"rgb(95,198,19)","size":12.0},{"label":"Cleomenes burns the grove.","x":-1426.8123779296875,"y":467.4821472167969,"id":"105","attributes":{"summary":"Cleomenes set fire to the grove, and groaned upon learning the god of the grove was Argus.","level of digression":"2","section(s)":"6.80","commentary":"[Primary Digression]"},"color":"rgb(198,134,233)","size":12.0}],"edges":[{"source":"20","target":"22","id":"237","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"170","target":"171","id":"403","attributes":{},"color":"rgb(117,168,138)","size":1.0},{"source":"138","target":"142","id":"371","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"50","target":"53","id":"272","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"14","target":"16","id":"231","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"112","target":"113","id":"340","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"22","target":"23","id":"238","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"117","target":"179","id":"411","attributes":{},"color":"rgb(216,134,127)","size":1.0},{"source":"58","target":"59","id":"279","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"71","target":"72","id":"292","attributes":{},"color":"rgb(140,139,67)","size":1.0},{"source":"189","target":"190","id":"424","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"169","target":"172","id":"404","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"192","target":"193","id":"427","attributes":{},"color":"rgb(117,168,138)","size":1.0},{"source":"162","target":"163","id":"394","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"59","target":"60","id":"280","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"34","target":"35","id":"252","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"149","target":"152","id":"383","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"183","target":"184","id":"418","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"16","target":"18","id":"233","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"195","target":"196","id":"431","attributes":{},"color":"rgb(0,202,255)","size":1.0},{"source":"176","target":"177","id":"409","attributes":{},"color":"rgb(234,134,21)","size":1.0},{"source":"72","target":"73","id":"293","attributes":{},"color":"rgb(46,144,114)","size":1.0},{"source":"120","target":"122","id":"349","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"83","target":"85","id":"309","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"8","target":"9","id":"224","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"107","target":"108","id":"335","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"85","target":"86","id":"310","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"1","target":"2","id":"217","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"80","target":"81","id":"304","attributes":{},"color":"rgb(117,168,138)","size":1.0},{"source":"159","target":"161","id":"392","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"43","target":"44","id":"261","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"135","target":"136","id":"364","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"172","target":"173","id":"405","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"24","target":"26","id":"241","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"174","target":"183","id":"416","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"92","target":"93","id":"318","attributes":{},"color":"rgb(0,202,255)","size":1.0},{"source":"124","target":"125","id":"352","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"120","target":"121","id":"348","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"50","target":"51","id":"269","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"40","target":"53","id":"273","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"126","target":"128","id":"356","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"174","target":"175","id":"407","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"41","target":"42","id":"259","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"102","target":"103","id":"329","attributes":{},"color":"rgb(216,134,127)","size":1.0},{"source":"108","target":"109","id":"336","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"106","target":"107","id":"334","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"68","target":"70","id":"290","attributes":{},"color":"rgb(234,134,21)","size":1.0},{"source":"55","target":"56","id":"276","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"157","target":"159","id":"390","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"142","target":"143","id":"372","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"111","target":"112","id":"339","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"6","target":"7","id":"222","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"99","target":"101","id":"327","attributes":{},"color":"rgb(234,134,21)","size":1.0},{"source":"12","target":"14","id":"229","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"53","target":"54","id":"274","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"104","target":"105","id":"332","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"152","target":"153","id":"384","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"46","target":"47","id":"264","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"4","target":"5","id":"220","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"109","target":"110","id":"337","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"42","target":"43","id":"260","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"20","target":"21","id":"236","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"77","target":"83","id":"307","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"144","target":"145","id":"374","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"126","target":"127","id":"355","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"57","target":"58","id":"278","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"188","target":"189","id":"423","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"68","target":"69","id":"289","attributes":{},"color":"rgb(140,139,67)","size":1.0},{"source":"181","target":"182","id":"414","attributes":{},"color":"rgb(140,139,67)","size":1.0},{"source":"18","target":"19","id":"234","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"165","target":"167","id":"398","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"24","target":"25","id":"240","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"129","target":"130","id":"358","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"66","target":"67","id":"287","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"150","target":"151","id":"381","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"10","target":"11","id":"226","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"40","target":"41","id":"258","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"113","target":"114","id":"341","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"56","target":"57","id":"277","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"155","target":"156","id":"387","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"36","target":"38","id":"255","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"2","target":"3","id":"218","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"130","target":"131","id":"359","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"142","target":"144","id":"373","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"0","target":"1","id":"216","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"89","target":"90","id":"314","attributes":{},"color":"rgb(0,202,255)","size":1.0},{"source":"65","target":"66","id":"286","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"184","target":"186","id":"420","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"164","target":"165","id":"396","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"14","target":"15","id":"230","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"167","target":"183","id":"417","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"11","target":"12","id":"227","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"125","target":"126","id":"353","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"105","target":"106","id":"333","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"83","target":"84","id":"308","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"67","target":"77","id":"299","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"3","target":"4","id":"219","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"75","target":"77","id":"297","attributes":{},"color":"rgb(122,139,173)","size":1.0},{"source":"19","target":"31","id":"248","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"80","target":"82","id":"305","attributes":{},"color":"rgb(0,202,255)","size":1.0},{"source":"140","target":"141","id":"369","attributes":{},"color":"rgb(0,202,255)","size":1.0},{"source":"9","target":"10","id":"225","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"67","target":"68","id":"288","attributes":{},"color":"rgb(117,168,138)","size":1.0},{"source":"117","target":"118","id":"345","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"165","target":"166","id":"397","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"60","target":"61","id":"281","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"49","target":"50","id":"267","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"90","target":"91","id":"315","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"147","target":"149","id":"379","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"94","target":"103","id":"330","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"103","target":"104","id":"331","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"44","target":"45","id":"262","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"136","target":"137","id":"365","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"31","target":"32","id":"249","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"141","target":"142","id":"370","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"47","target":"48","id":"265","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"31","target":"33","id":"250","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"77","target":"78","id":"301","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"131","target":"133","id":"361","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"154","target":"155","id":"386","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"48","target":"49","id":"266","attributes":{},"color":"rgb(0,202,255)","size":1.0},{"source":"39","target":"40","id":"257","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"78","target":"79","id":"302","attributes":{},"color":"rgb(0,202,255)","size":1.0},{"source":"70","target":"71","id":"291","attributes":{},"color":"rgb(234,134,21)","size":1.0},{"source":"29","target":"30","id":"245","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"115","target":"116","id":"343","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"161","target":"162","id":"393","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"137","target":"145","id":"375","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"26","target":"27","id":"242","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"184","target":"185","id":"419","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"79","target":"80","id":"303","attributes":{},"color":"rgb(0,202,255)","size":1.0},{"source":"97","target":"98","id":"324","attributes":{},"color":"rgb(117,168,138)","size":1.0},{"source":"64","target":"65","id":"285","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"145","target":"146","id":"376","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"93","target":"94","id":"319","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"112","target":"124","id":"351","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"88","target":"89","id":"313","attributes":{},"color":"rgb(0,202,255)","size":1.0},{"source":"138","target":"139","id":"367","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"169","target":"170","id":"402","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"5","target":"6","id":"221","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"63","target":"64","id":"284","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"94","target":"95","id":"321","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"159","target":"160","id":"391","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"131","target":"132","id":"360","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"186","target":"187","id":"421","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"38","target":"39","id":"256","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"119","target":"120","id":"347","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"167","target":"169","id":"401","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"191","target":"192","id":"426","attributes":{},"color":"rgb(234,134,21)","size":1.0},{"source":"118","target":"119","id":"346","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"75","target":"76","id":"296","attributes":{},"color":"rgb(150,118,121)","size":1.0},{"source":"175","target":"176","id":"408","attributes":{},"color":"rgb(117,168,138)","size":1.0},{"source":"177","target":"178","id":"410","attributes":{},"color":"rgb(140,139,67)","size":1.0},{"source":"167","target":"168","id":"400","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"186","target":"188","id":"422","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"82","target":"83","id":"306","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"35","target":"36","id":"253","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"181","target":"183","id":"415","attributes":{},"color":"rgb(164,166,20)","size":1.0},{"source":"74","target":"75","id":"295","attributes":{},"color":"rgb(46,144,114)","size":1.0},{"source":"101","target":"102","id":"328","attributes":{},"color":"rgb(234,134,21)","size":1.0},{"source":"149","target":"150","id":"380","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"27","target":"28","id":"243","attributes":{},"color":"rgb(0,202,255)","size":1.0},{"source":"33","target":"34","id":"251","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"65","target":"126","id":"354","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"128","target":"129","id":"357","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"23","target":"24","id":"239","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"87","target":"91","id":"316","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"47","target":"50","id":"268","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"147","target":"148","id":"378","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"86","target":"87","id":"311","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"95","target":"97","id":"323","attributes":{},"color":"rgb(0,202,255)","size":1.0},{"source":"134","target":"135","id":"363","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"155","target":"157","id":"388","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"163","target":"164","id":"395","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"87","target":"88","id":"312","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"16","target":"17","id":"232","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"73","target":"74","id":"294","attributes":{},"color":"rgb(46,144,114)","size":1.0},{"source":"59","target":"63","id":"283","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"193","target":"194","id":"429","attributes":{},"color":"rgb(117,168,138)","size":1.0},{"source":"179","target":"180","id":"412","attributes":{},"color":"rgb(234,134,21)","size":1.0},{"source":"172","target":"174","id":"406","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"44","target":"46","id":"263","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"26","target":"30","id":"246","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"114","target":"115","id":"342","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"51","target":"52","id":"270","attributes":{},"color":"rgb(0,202,255)","size":1.0},{"source":"66","target":"77","id":"300","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"157","target":"158","id":"389","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"98","target":"99","id":"325","attributes":{},"color":"rgb(234,134,21)","size":1.0},{"source":"52","target":"53","id":"271","attributes":{},"color":"rgb(47,200,137)","size":1.0},{"source":"28","target":"29","id":"244","attributes":{},"color":"rgb(0,202,255)","size":1.0},{"source":"71","target":"77","id":"298","attributes":{},"color":"rgb(216,134,127)","size":1.0},{"source":"95","target":"96","id":"322","attributes":{},"color":"rgb(117,168,138)","size":1.0},{"source":"12","target":"13","id":"228","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"137","target":"138","id":"366","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"138","target":"140","id":"368","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"19","target":"20","id":"235","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"91","target":"94","id":"320","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"91","target":"92","id":"317","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"109","target":"111","id":"338","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"153","target":"154","id":"385","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"190","target":"191","id":"425","attributes":{},"color":"rgb(117,168,138)","size":1.0},{"source":"99","target":"100","id":"326","attributes":{},"color":"rgb(140,139,67)","size":1.0},{"source":"190","target":"193","id":"428","attributes":{},"color":"rgb(0,202,255)","size":1.0},{"source":"162","target":"167","id":"399","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"193","target":"195","id":"430","attributes":{},"color":"rgb(0,202,255)","size":1.0},{"source":"145","target":"147","id":"377","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"116","target":"117","id":"344","attributes":{},"color":"rgb(198,134,233)","size":1.0},{"source":"122","target":"123","id":"350","attributes":{},"color":"rgb(99,168,244)","size":1.0},{"source":"53","target":"55","id":"275","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"151","target":"152","id":"382","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"30","target":"31","id":"247","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"180","target":"181","id":"413","attributes":{},"color":"rgb(234,134,21)","size":1.0},{"source":"7","target":"8","id":"223","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"133","target":"134","id":"362","attributes":{},"color":"rgb(95,198,19)","size":1.0},{"source":"36","target":"37","id":"254","attributes":{},"color":"rgb(146,166,126)","size":1.0},{"source":"61","target":"62","id":"282","attributes":{},"color":"rgb(117,168,138)","size":1.0}]}